[
  {
    "title": "Senior Frontend Developer",
    "location": "Remote",
    "description": "We are looking for an experienced Frontend Developer to join our team. You will be responsible for building the ‘client-side’ of our web applications. You should be able to translate our company and customer needs into functional and appealing interactive applications.",
    "requirements": [
      "Proven work experience as a Frontend Developer",
      "Experience with JavaScript, CSS and HTML",
      "Familiarity with browser testing and debugging",
      "In-depth understanding of the entire web development process (design, development and deployment)",
      "Understanding of layout aesthetics",
      "An ability to perform well in a fast-paced environment",
      "Excellent analytical and multitasking skills"
    ]
  },
  {
    "title": "Backend Developer",
    "location": "San Francisco, CA",
    "description": "We are looking for a Backend Developer to join our team. You will be responsible for the server-side of our web applications. You should be able to translate our company and customer needs into functional and appealing interactive applications.",
    "requirements": [
      "Proven work experience as a Backend Developer",
      "Experience with Node.js, Python, or Java",
      "Familiarity with databases (e.g. MySQL, MongoDB), web servers (e.g. Apache) and UI/UX design",
      "In-depth understanding of the entire web development process (design, development and deployment)",
      "An ability to perform well in a fast-paced environment",
      "Excellent analytical and multitasking skills"
    ]
  },
  {
    "title": "Full Stack Developer",
    "location": "New York, NY",
    "description": "We are looking for a Full Stack Developer to join our team. You will be responsible for both the server-side and client-side of our web applications. You should be able to translate our company and customer needs into functional and appealing interactive applications.",
    "requirements": [
      "Proven work experience as a Full Stack Developer",
      "Experience with JavaScript, CSS and HTML",
      "Experience with Node.js, Python, or Java",
      "Familiarity with databases (e.g. MySQL, MongoDB), web servers (e.g. Apache) and UI/UX design",
      "In-depth understanding of the entire web development process (design, development and deployment)",
      "An ability to perform well in a fast-paced environment",
      "Excellent analytical and multitasking skills"
    ]
  },
  {
    "title": "DevOps Engineer",
    "location": "Austin, TX",
    "description": "We are seeking a DevOps Engineer to help automate and streamline our operations and processes. You will be responsible for building and maintaining tools for deployment, monitoring, and operations.",
    "requirements": [
      "Proven experience as a DevOps Engineer or similar software engineering role",
      "Proficiency with CI/CD tools (e.g., Jenkins, GitHub Actions)",
      "Experience with cloud services (AWS, Azure, GCP)",
      "Strong scripting skills in Bash, Python, or similar",
      "Experience with container technologies like Docker and Kubernetes",
      "Problem-solving attitude",
      "Strong collaboration and communication skills"
    ]
  },
  {
    "title": "Mobile App Developer",
    "location": "Remote",
    "description": "We are looking for a Mobile App Developer to join our team. You will be responsible for developing high-quality mobile applications for Android and iOS platforms.",
    "requirements": [
      "Proven experience as a Mobile Developer",
      "Experience with Flutter, React Native, or native Android/iOS development",
      "Understanding of mobile UI/UX design principles",
      "Familiarity with REST APIs and JSON",
      "Experience with third-party libraries and APIs",
      "Ability to work in an agile development environment",
      "Excellent analytical and problem-solving skills"
    ]
  },
  {
    "title": "UI/UX Designer",
    "location": "Los Angeles, CA",
    "description": "We are looking for a talented UI/UX Designer to create amazing user experiences. The ideal candidate should have an eye for clean and artful design and be able to translate high-level requirements into interaction flows and artifacts.",
    "requirements": [
      "Proven UI/UX design experience",
      "Proficiency in design tools such as Figma, Sketch, Adobe XD",
      "Experience in creating wireframes, storyboards, user flows, process flows and site maps",
      "Up-to-date with the latest UI trends, techniques, and technologies",
      "Ability to solve problems creatively and effectively",
      "Excellent communication skills",
      "Team spirit and strong collaboration skills"
    ]
  }
]
